[
    {
      "id": 1,
      "title": "Strategic Systems Engineering at Texaco",
      "message": "This archive showcases a series of engineering wins from my time at Texaco’s Los Angeles refinery—where I led initiatives that redefined SCADA integration, automated fragile infrastructure, and built secure desktop environments from the ground up.",
      "linkText": "Legacy Engineering at Texaco",
      "linkTarget": "legacy-engineering-texaco",
      "autoCollapseMs": 15000
    },
    {
      "id": 2,
      "title": "Legacy Systems Engineering",
      "message": "Senior Architect and Infrastructure Strategist with proven success stabilizing and modernizing COBOL and FORTRAN 77 platforms across SCADA, ICS, and compliance-heavy industrial environments. Adept at translating vintage logic into maintainable, interoperable systems while mentoring teams and guiding resilient modernization trajectories. Specialized in integrating legacy components into automated stacks and preserving mission-critical reliability through pragmatic engineering.",
      "linkText": "Legacy Support",
      "linkTarget": "legacy-profile",
      "autoCollapseMs": 15000
    },
    {
      "id": 3,
      "title": "Problem Solving Profile",
      "message": "From firmware to Freon, refinery to registry—each solution reflects practical ingenuity across domains and decades.",
      "linkText": "Problem Solving Profile",
      "linkTarget": "problem-solving-profile",
      "autoCollapseMs": 15000
    },
    {
      "id": 4,
      "title": "Change Management & Governance",
      "message": "Explore how I architected audit-ready release pipelines, implemented RPN scoring, and enforced GitFlow discipline across enterprise teams. This section documents my approach to ITIL-aligned governance, emergency change protocols, and regulatory mapping for NERC CIP, NRC, and FISMA compliance.",
      "linkText": "Change Management",
      "linkTarget": "change-governance",
      "autoCollapseMs": 15000
    },
    {
      "id": 5,
      "title": "Strategic Engineering Persona",
      "message": "A discoverable archive of STAR responses, strategic interview questions, and visual overlays that showcase my architectural mindset, fault recovery instincts, and mentorship philosophy. This section links engineering wins to real-world impact and legacy preservation.",
      "linkText": "Engineering Persona",
      "linkTarget": "strategic-persona",
      "autoCollapseMs": 15000
    }
]
  