[
    {
      "id": 1,
      "title": "Introduction to Project Planning: An Overview of the Importance of Planning in Software Development",
      "summary": "In the high-stakes world of software development, project planning is the unsung hero. It's the invisible thread that weaves together every aspect of a project, ensuring that all the moving parts work in harmony. Without a solid plan, even the most groundbreaking ideas can crumble under the weight of missed deadlines, skyrocketing costs, and frustrated clients. Let’s dive into why planning is the bedrock of successful software development.",
      "link": "https://www.linkedin.com/pulse/introduction-project-planning-overview-importance-software-mark-hogan-l1z6e/?trackingId=33w51uV9Q3SsW8X4eDd1Fw%3D%3D",
      "imageUrl": "/assets/images/Introduction to Project Planning_ An overview of the importance of planning in software development.png"
    },
    {
      "id": 2,
      "title": "Strategic Systems Engineering at Texaco: A Legacy of Resilience and Innovation",
      "summary": "At Texaco’s Los Angeles refinery, I wasn’t just solving problems—I was rewriting the rules of what legacy infrastructure could do. From restoring telemetry across decommissioned SCADA systems to automating domain hygiene before native tools existed, each solution reflects a mindset of strategic clarity, technical empathy, and relentless curiosity.",
      "link": "https://www.linkedin.com/pulse/strategic-systems-engineering-texaco-legacy-resilience-mark-hogan-6rltc/?trackingId=o5M%2BFy2%2BRCehp1ErmJy9QQ%3D%3D",
      "imageUrl": "/assets/images/Strategic_Systems_Engineering_Texaco_Legacy.png"
    },
    {
      "id": 3,
      "title": "Completely Automating Microsoft Windows Installations to Produce \"Ready to Use\" Systems for Business and Process Control Systems",
      "summary": "We believe computers should just work—every time, for every user. Whether it’s the first login or the thousandth, email, tools, and access should be seamless. Users shouldn’t face setup prompts or administrative tasks; those are handled in advance by administrators. Our goal is simple: log in, get to work, and trust that everything functions consistently across every device, every day. It should just work.",
      "link": "https://www.linkedin.com/pulse/completely-automating-microsoft-windows-installations-mark-hogan/?trackingId=o5M%2BFy2%2BRCehp1ErmJy9QQ%3D%3D",
      "imageUrl": "/assets/images/Completely Automating Microsoft Windows Installations.png"
    }
]